Forged-in-Feathers-Technology/observore/sdkconfig.defaults
# Target: Seeed Studio XIAO ESP32S3 (ESP32-S3R8, 8 MB flash, 8 MB octal PSRAM)

CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# PSRAM.  The device table and the JSON buffer fit comfortably in internal RAM,
# but leaving PSRAM on gives the Wi-Fi and BLE stacks room to coexist.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Console over the S3's native USB-Serial/JTAG -- the XIAO has no UART bridge.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Bluetooth: NimBLE, observer only.  No advertising, no GATT server, nothing
# that would make this device visible to anything it is watching.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# Wi-Fi and BLE share one radio; the arbiter has to be on or the sniffer
# starves the BLE scanner.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Sniffing needs the promiscuous RX path and more RX buffers than the default,
# since management frames arrive in bursts on a busy channel.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Wi-Fi uplink credentials are deliberately EMPTY here -- this file is tracked
# by git.  Set them with `idf.py menuconfig` (sdkconfig is gitignored), or with
# a gitignored credentials.conf, or at runtime from the console.
# See README, "Joining your network".
CONFIG_OBSERVORE_WIFI_SSID=""
CONFIG_OBSERVORE_WIFI_PASSWORD=""

# Gotify pushes go over TLS to whatever host you run, so the Mozilla root
# bundle is compiled in rather than pinning a single certificate.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
